### More data processing with _pandas_ !

#### Section 3.1

( Merging Dataframes )

In [1]:
# example 1

import pandas as pd

staff = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR'},
                      {'Name': 'Sally', 'Role': 'Course liasion'},
                      {'Name': 'James', 'Role': 'Grader'}])

staff_df = staff.set_index('Name')

student = pd.DataFrame([{'Name': 'James', 'School': 'Business'},
                        {'Name': 'Mike', 'School': 'Law'},
                        {'Name': 'Sally', 'School': 'Engineering'}])

student_df = student.set_index('Name')

print(staff_df.head())
print(student_df.head())

                 Role
Name
Kelly  Director of HR
Sally  Course liasion
James          Grader
            School
Name
James     Business
Mike           Law
Sally  Engineering

In [2]:
# Union :

pd.merge(staff_df, student_df, how='outer', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally  Course liasion  Engineering

In [3]:
# Intersection :

pd.merge(staff_df, student_df, how='inner', left_index=True, right_index=True)

                 Role       School
Name
Sally  Course liasion  Engineering
James          Grader     Business

In [4]:
# Left join :

pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)

                 Role       School
Name
Kelly  Director of HR          NaN
Sally  Course liasion  Engineering
James          Grader     Business

In [5]:
# Right join :

pd.merge(staff_df, student_df, how='right', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Mike              NaN          Law
Sally  Course liasion  Engineering

In [6]:
# example 2

staff_df = staff_df.reset_index()

student_df = student_df.reset_index()

pd.merge(staff_df, student_df, how='right', on='Name')

    Name            Role       School
0  James          Grader     Business
1   Mike             NaN          Law
2  Sally  Course liasion  Engineering

In [9]:
# example 3

staff = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR',
                       'Location': 'State Street'},
                      {'Name': 'Sally', 'Role': 'Course liasion',
                       'Location': 'Washington Avenue'},
                      {'Name': 'James', 'Role': 'Grader',
                       'Location': 'Washington Avenue'}])

student = pd.DataFrame([{'Name': 'James', 'School': 'Business',
                         'Location': '1024 Billiard Avenue'},
                        {'Name': 'Mike', 'School': 'Law',
                         'Location': 'Fraternity House #22'},
                        {'Name': 'Sally', 'School': 'Engineering',
                         'Location': '512 Wilson Crescent'}])

pd.merge(staff, student, how='left', on='Name')

    Name            Role         Location_x       School            Location_y
0  Kelly  Director of HR       State Street          NaN                   NaN
1  Sally  Course liasion  Washington Avenue  Engineering   512 Wilson Crescent
2  James          Grader  Washington Avenue     Business  1024 Billiard Avenue

#### Section 3.3

( Group by )

We have seen though _Pandas_ allows us to iterate over every row in a dataframe, it is geneally very slow to do so. Fortunately _Pandas_ has a _groupby()_ function to speed up such task.

1. **Aggregation**